{
    "project": [
        {
            "name": "Email Client-React Project",
            "description": "I completed this project as part of a team using React and TailWind to build an email client based on a supplied design and an existing API. The application included features such as pagination, search, and filters, and had a responsive front-end.",
            "img": "https://i.imgur.com/wyJoztN.png",
            "githublink": "https://github.com/iO-Academy/2024-sept-red-pandas-email-fe",
            "livelink": "https://2024-red-pandas-email-client.dev.io-academy.uk/",
            "modalbutton": "Information",
            "moreinfo": "I worked on the 'open email' and 'search bar' features of the email client. I am particularly proud of the search bar functionality, which filters/unfilters the emails as the user types."
        },
        {
            "name": "Project Manager-PHP Project",
            "description": "I built this project manager as part of a team using PHP. We were provided with the front-end for this project and were supplied with an API. I built the back-end for this project manager using Object Oriented Programming in PHP and MySQL. I wrote and employed unit tests to ensure our code worked correctly.",
            "img": "https://i.imgur.com/lXX9O25.png",
            "githublink": "https://github.com/iO-Academy/2024-sept-resourceful-racoons-project-management",
            "livelink": "https://2024-racoons-project-management.dev.io-academy.uk/" ,
            "modalbutton": "Information",
            "moreinfo": "I worked on: fetching and displaying all active projects; fetching and displaying a specific task; displaying a specific task in red if it was overdue or grey if it wasn't overdue; writing the unit tests for all stories. I really enjoyed the problem-solving aspect of writing the unit tests in this project."
        },
        {
            "name": "Hotel Booking API-Laravel Project",
            "description": "I built this project as part of a team. We built an API for a hotel booking website using Object Orientated Programming with Laravel using Postman and MySQL that works with a pre-built React front-end application. I wrote and employed HTTP tests.",
            "img": "https://i.imgur.com/adZTYcA.png",
            "githublink": "https://github.com/iO-Academy/2024-sept-rain-frogs-hotel-api",
            "livelink": "https://2024-rainfrogs-hotel-api.dev.io-academy.uk/api/rooms",
            "modalbutton": "Information",
            "moreinfo": "I worked on: returning the information for a single hotel room; returning information on all current and future bookings; generating a report that returned the total number of bookings for each room ever and the average booking duration for each room. I then wrote passing HTTP tests for each of these stories."
        }
    ]
}

